In [4]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    'Groups':['A','B','C','A','B','C'],
    'Variable_1':[10,23,33,22,11,99],
    'Variable_2':[100,253,333,262,111,969]},
    columns=['Groups','Variable_1','Variable_2'])
df

  Groups  Variable_1  Variable_2
0      A          10         100
1      B          23         253
2      C          33         333
3      A          22         262
4      B          11         111
5      C          99         969

In [3]:
#aggregate Func
df.groupby("Groups").mean()

        Variable_1  Variable_2
Groups
A               16         181
B               17         182
C               66         651

In [5]:
df.groupby("Groups").aggregate(["min",np.median,max])

       Variable_1            Variable_2
              min median max        min median  max
Groups
A              10     16  22        100    181  262
B              11     17  23        111    182  253
C              33     66  99        333    651  969

In [7]:
df.groupby("Groups").aggregate({"Variable_1":min,"Variable_2":max})

        Variable_1  Variable_2
Groups
A               10         262
B               11         253
C               33         969